const th = {
  home: "หน้าหลัก",
  report: "รายงาน",
  library: "เอกสาร",
  news: "ข่าวสาร",
  contact: "ติดต่อ",
  profile: "โปรไฟล์",

  course: "หลักสูตร",
  about: "เกี่ยวกับเรา",
  howto: "วิธีใช้งาน",
  faq: "คำถามที่พบบ่อย",
  terms: "เงื่อนไขการใช้งาน",

  registerReport: "รายงานการลงทะเบียน",
  trainingReport: "รายงานการฝึกอบรม",
  trainingEvaluationReport: "รายงานประเมินผล",

    accept: "ยอมรับและดำเนินการต่อ",

  menu: "เมนู",
  messroom: "ห้องอาหาร",
  advertising: "ป้ายประชาสัมพันธ์",
  boards: "",
  video: "วิดีโอ",
  documentDownload: "ดาวน์โหลดเอกสาร",
  websiteVisitors: "ผู้เข้าชมเว็บไซต์",
  tapToView: "กดเพื่อดูข้อมูล",
  courseDesc: "เรียนรู้เนื้อหาสำคัญสำหรับพนักงานเรือ",
  newsDesc: "ข่าวสารและประกาศจาก THORESEN",
  developing: "หน้านี้กำลังพัฒนาอยู่",

  homepage: "หน้าหลัก",
footer: "Thoresen e-Learning",

aboutRedTitle: "โทเรเซน ชิปปิ้ง",
learning: "การเรียนรู้",
organisation: "องค์กร",
aboutSmallTitle: "เราให้ความสำคัญกับ\nการเรียนรู้อย่างต่อเนื่อง",
learningWord: "การเรียนรู้",

aboutParagraph1:
  "โทเรเซน ชิปปิ้ง เป็นบริษัทขนส่งทางเรือที่มีชื่อเสียงในระดับนานาชาติ และเป็นหนึ่งในกลุ่มธุรกิจหลักภายใต้บริษัท โทรีเซนไทย เอเยนต์ซีส์ จำกัด (มหาชน) หรือ TTA ซึ่งเป็นบริษัทที่ลงทุนในตลาดหลักทรัพย์แห่งประเทศไทย โดย Thoresen Shipping Singapore Pte Ltd. (TSS) และ Thoresen (Bangkok) Co., Ltd. (TCB) ดำเนินธุรกิจขนส่งสินค้าแห้งเทกองระหว่างประเทศ เริ่มตั้งแต่ปี 1904 และดำเนินธุรกิจขนส่งสินค้าแห้งเทกองตั้งแต่ปี 1985",

aboutParagraph2:
  "กองเรือของโทเรเซน ชิปปิ้ง ให้บริการขนส่งทางทะเลไปยังภูมิภาคต่าง ๆ ทั่วโลก บริษัทมีรูปแบบการให้บริการที่หลากหลายตามความต้องการของลูกค้า เช่น บริการเช่าเรือในระยะเวลาที่กำหนด และบริการเช่าเรือตามสัญญาขนส่งสินค้า นอกจากการให้บริการด้วยกองเรือของตนเองแล้ว ยังมีการเช่าเรือเพิ่มเติมเพื่อรองรับความต้องการของลูกค้าที่เพิ่มขึ้น",

aboutParagraph3:
  "กองเรือทั้งหมดได้รับการบริหารโดยทีมงานมืออาชีพที่มีประสบการณ์จากสำนักงานใหญ่ในกรุงเทพฯ สิงคโปร์ และลอนดอน ประเทศอังกฤษ ตลาดขนส่งสินค้าแห้งเทกองมีการแข่งขันสูง ความได้เปรียบของโทเรเซน ชิปปิ้ง มาจากทีมบริหารและทีมการตลาดที่มีคุณภาพ ซึ่งสามารถให้บริการที่ตอบสนองความต้องการและสร้างความพึงพอใจให้แก่ลูกค้าได้อย่างต่อเนื่อง",

aboutParagraph4:
  "บริษัทมุ่งมั่นพัฒนาพนักงานทุกคนให้มีความรู้ ความสามารถ และเพิ่มประสิทธิภาพในการปฏิบัติงาน เพื่อรองรับการเติบโตและการแข่งขันทางธุรกิจตามนโยบายของบริษัท",

aboutParagraph5:
  "เป็นหนึ่งในค่านิยมหลักขององค์กร ดังนั้นบริษัทจะมุ่งมั่นพัฒนาและส่งเสริมการเรียนรู้ทั้งภายในและภายนอกสถานที่ทำงานให้แก่พนักงานทุกคน",

aboutParagraph6:
  "เป็นหนึ่งในช่องทางที่ใช้ในการสื่อสาร และที่สำคัญคือผ่านระบบการเรียนทางไกลหรือ E-learning โดยมีเป้าหมายเพื่อช่วยให้พนักงานทุกคนได้รับความรู้ ทักษะ ความเชี่ยวชาญ และกลยุทธ์ในการพัฒนาอาชีพได้ทุกเวลา",

  overviewRegisterReport: "ภาพรวมรายงานการลงทะเบียน",
registerReportShipStaff: "รายงานการลงทะเบียนสำหรับลูกเรือ",
registerReportOfficeStaff: "รายงานการลงทะเบียนสำหรับพนักงานสำนักงาน",
overviewTrainingCourseReport: "ภาพรวมรายงานหลักสูตรฝึกอบรม",
trainingCourseShipStaff: "รายงานหลักสูตรฝึกอบรมสำหรับลูกเรือ",
trainingCourseOfficeStaff: "รายงานหลักสูตรฝึกอบรมสำหรับพนักงานสำนักงาน",
overviewTestReport: "ภาพรวมรายงานการทดสอบ",
testResultShipStaff: "รายงานผลการทดสอบสำหรับลูกเรือ",
testResultOfficeStaff: "รายงานผลการทดสอบสำหรับพนักงานสำนักงาน",

termsHeading1: "1. Lorem Ipsum คืออะไร?",
termsParagraph1:
  "Lorem Ipsum คือข้อความตัวอย่างที่ใช้ในงานพิมพ์และงานจัดวางตัวอักษร โดยถูกใช้เป็นข้อความมาตรฐานในอุตสาหกรรมมาตั้งแต่ช่วงปี ค.ศ. 1500",

termsHeading2: "2. ข้อความนี้มาจากไหน?",
termsParagraph2:
  "โดยทั่วไป Lorem Ipsum ไม่ใช่ข้อความสุ่ม แต่มีรากฐานมาจากวรรณกรรมภาษาละตินโบราณเมื่อประมาณ 45 ปีก่อนคริสตกาล",

  documentTypeLibrary: "คลังประเภทเอกสาร",
multimediaLibrary: "คลังสื่อมัลติมีเดีย",
heliAtHome: "เฮลิคอปเตอร์ที่บ้าน",
search: "ค้นหา",
all: "ทั้งหมด",
view: "ดู",

back: "กลับ",
employeeType: "ประเภทพนักงาน",
selectType: "เลือกประเภท",
shipStaff: "พนักงานเรือ",
officeStaff: "พนักงานสำนักงาน",
department: "แผนก",
selectDepartment: "เลือกแผนก",
chartType: "ประเภทรายงาน",
columnChart: "กราฟแท่ง",
pieChart: "กราฟวงกลม",
position: "ตำแหน่ง",
selectPosition: "เลือกตำแหน่ง",
level: "ระดับ",
selectLevel: "เลือกระดับ",
status: "สถานะ",
approved: "อนุมัติ",
disapproved: "ไม่อนุมัติ",
suspension: "ระงับการใช้งาน",
startDate: "วันที่เริ่มต้น",
endDate: "วันที่สิ้นสุด",
fromYear: "ปีเริ่มต้น",
toYear: "ปีสิ้นสุด",
selectFromYear: "เลือกปีเริ่มต้น",
selectToYear: "เลือกปีสิ้นสุด",
noData: "ไม่พบข้อมูล",

crewComplaint: 'ช่องทางร้องเรียนลูกเรือ',
vesselName: 'ชื่อเรือ',
dateOfProblem: 'วันที่เกิดปัญหา',
message: 'ข้อความ',
uploadPhoto: 'อัปโหลดรูปภาพ',
chooseFile: 'เลือกไฟล์',
noFileChosen: 'ยังไม่ได้เลือกไฟล์',
securityCode: 'รหัสความปลอดภัย',
clickToRefresh: 'กดเพื่อรีเฟรช',
refresh: 'รีเฟรช',
enterCode: 'กรอกรหัสด้านบน',
confirm: 'ยืนยัน',

crewNotice:
'ข้อมูลทั้งหมดจะถูกส่งตรงถึงผู้บริหารระดับสูงโดยไม่เปิดเผยต่อบุคคลภายนอก',

crewHelp:
'หากลืมชื่อผู้ใช้ รหัสผ่าน หรือต้องการรีเซ็ตการสอบ กรุณาดู FAQ หรือติดต่อ MTD หรือ MPD',

crewMessagePlaceholder:
'พิมพ์ข้อความร้องเรียนหรือข้อเสนอแนะเกี่ยวกับการทำงานบนเรือ ความเป็นอยู่ การทุจริต การกลั่นแกล้ง หรือเรื่องอื่น ๆ',

};

export default th;